module attributes {torch.debug_module_name = "Conv2d"} {
  func.func @forward(%arg0: tensor<3x3x32x32xf32>) -> tensor<3x3x30x30xf32> {
    %0 = "tosa.const"() {value = dense<[[[[3.396920e-02, 0.17436485, 0.180754587], [0.0488044024, 0.158198223, -0.17058982], [-0.0888523682, 0.0604453422, -0.0686706379]], [[0.161647692, 0.131004661, -0.02863192], [0.0352134034, -0.121758856, -0.0991110578], [0.151713789, 0.0223951805, -9.176910e-02]], [[0.0466219932, 0.118191764, 0.0963166728], [-0.157311127, 0.0343057103, -0.0167813823], [-0.101143502, -0.145776406, 0.179265648]]], [[[-0.188711539, -0.156370267, 0.0282388795], [0.165153936, -0.120644383, 0.0201022811], [0.0829014331, 0.15481697, -0.0841446295]], [[0.191042855, 0.155267701, 0.00244906428], [-0.19026351, -0.0358773209, -0.094327569], [0.159624979, 0.0804599896, 0.0137165356]], [[0.0184830688, -0.0658675581, -0.00350991776], [0.158793747, 0.157207847, 0.02803066], [-0.104998231, 9.290490e-02, -0.0600154363]]], [[[0.141454309, 0.0446874425, -0.162933886], [0.0755951926, -0.18755722, -0.0504731908], [0.0922515615, 0.186490789, -0.015916314]], [[0.018533932, -0.174146175, 0.0346606895], [-0.00185709598, -0.0557042509, -0.0845026373], [-0.133884072, -0.0600683391, 0.0988910049]], [[-0.0300068688, 0.160527423, -0.0706019923], [-0.0537946671, 0.0229859091, -0.0043382789], [0.071878545, -0.127077922, -0.110968433]]]]> : tensor<3x3x3x3xf32>} : () -> tensor<3x3x3x3xf32>
    %1 = "tosa.const"() {value = dense<[0.0183118079, 0.0520551465, -0.178210557]> : tensor<3xf32>} : () -> tensor<3xf32>
    %2 = "tosa.const"() {value = dense<[0, 2, 3, 1]> : tensor<4xi32>} : () -> tensor<4xi32>
    %3 = "tosa.const"() {value = dense<[0, 3, 1, 2]> : tensor<4xi32>} : () -> tensor<4xi32>
    %4 = "tosa.transpose"(%arg0, %2) : (tensor<3x3x32x32xf32>, tensor<4xi32>) -> tensor<3x32x32x3xf32>
    %5 = "tosa.conv2d"(%4, %0, %1) {dilation = [1, 1], pad = [0, 0, 0, 0], stride = [1, 1]} : (tensor<3x32x32x3xf32>, tensor<3x3x3x3xf32>, tensor<3xf32>) -> tensor<3x30x30x3xf32>
    %6 = "tosa.transpose"(%5, %3) : (tensor<3x30x30x3xf32>, tensor<4xi32>) -> tensor<3x3x30x30xf32>
    return %6 : tensor<3x3x30x30xf32>
  }
}
